Repository: ramiroencinas/perl6doc-es
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: es_es

source: If two objects compare equally via C<===>, their C<.WHICH> methods return the same ObjAt object.
es_es: Si dos objetos son iguales con la comparación C<===>, sus métodos C<.WHICH> devuelven el mismo objeto ObjAt.

source: If you are creating a promise that you intend to keep or break yourself then you probably don't want any code that might receive the promise to inadvertently (or otherwise,) keep or break the promise before you do.
es_es: Si quieres realizar a demanda la consecución (C<keep>) o la excepción (C<break>) de una promesa, tendrás que hacerlo antes de que lo haga alguna otra parte del código.

source: If you are using the C<react> or C<supply> block syntax with C<whenever>, you can add phasers within your C<whenever> blocks to handle the C<done> and C<quit> messages from the tapped supply:
es_es: Si utilizas C<whenever> con la sintaxis de los bloques C<react> o C<supply>, puedes utilizar faseados en los bloques C<whenever> para gestionar los mensajes de C<done> y C<quit> desde el tap del suministro:

source: If you need to have an action that runs when the supply finishes, you can do so by setting the C<done> and C<quit> options in the call to C<tap>:
es_es: Si necesitas ejecutar código cuando finalice el suministro, puedes hacerlo indicando las opciones C<done> y C<quit> en la llamada del C<tap>:

source: If you want to write to the standard input of the program you can supply the C<:w> adverb to the constructor and use the methods L<write|/type/Proc::Async#method_write>, L<print|/type/Proc::Async#method_print> or L<say|/type/Proc::Async#method_say> to write to the opened pipe once the program has been started:
es_es: Para escribir en la entrada estándar del comando indica el adverbio C<:w> en el constructor y utiliza los métodos L<write|/type/Proc::Async#method_write>, L<print|/type/Proc::Async#method_print> o L<say|/type/Proc::Async#method_say> para escribir en la tubería abierta una vez que se ejecute el comando:

source: In addition to C<await>, two class methods combine several L<Promise> objects into a new promise: C<allof> returns a promise that is kept when all the original promises are kept or broken:
es_es: Además del uso de C<await>, los métodos de clases (C<allof> y C<anyof>) pueden combinar varios objetos L<Promesa> en una promesa nueva: C<allof> devuelve una promesa cuyo resultado está disponible cuando todas las promesas originales finalizan correctamente o dan una excepción:

source: In both cases the completion of the code encapsulated by the L<Thread> object can be waited on with the C<finish> method which will block until the thread completes:
es_es: En ambos casos puede utilizarse el método C<finish> para esperar a que finalice el código encapsulado del L<Hilo> mientras éste queda bloquedado:

source: In common with most modern programming languages, Perl 6 is designed to L<support concurrency|http://en.wikipedia.org/wiki/Concurrent_computing> (allowing more than one thing to happen at the same time) and asynchronous programming (sometimes called event driven or reactive programming - that is an event or change in some part of a program may lead to an event or change in some other part of the program asynchronously to the program flow).
es_es: Al igual que la mayoría de los lenguajes de programación modernos, Perl 6 es L<concurrente|http://en.wikipedia.org/wiki/Concurrent_computing> (hace que sucedan varias cosas al mismo tiempo) y permite la programación asíncrona (también llamada orientada a eventos o programación reactiva - de forma que si se produce un evento o cambio en alguna parte del programa puede producirse un evento o cambio en otra parte del programa de forma asíncrona respecto al flujo del programa).

source: In this case the code in the supply block is executed every time the L<Supply> returned by C<supply> is tapped, as demonstrated by:
es_es: En este caso el código dentro del bloque supply se ejecuta cada vez que el L<Suministro> devuelto por C<supply> utiliza el método C<tap>, como puedes ver a continuación:

source: In this case the code will be scheduled to run until the program ends normally, however the method returns a L<Cancellation> object which can be used to cancel the scheduled execution before normal completion:
es_es: En este caso el código programará la ejecución del programa hasta que finalice de forma normal. Para cancelar la ejecución programada antes de que finalice se utiliza el método C<cancel> que devolverá un objeto L<Cancellation>:

source: It is also possible to obtain a L<Channel> from a L<Supply> using the L<Supply method|/type/Supply#method_Channel> which returns a L<Channel> which is fed by a C<tap> on the L<Supply>:
es_es: También es posible obtener un L<Canal> desde un L<Suministro> mediante el L<método Supply|/type/Supply#method_Channel> devolviendo un L<Canal> alimentado desde el C<tap> del L<Suministro>:

source: It provides much of the functionality that user code needs to operate in a concurrent or asynchronous manner.
es_es: Proporciona gran parte de la funcionalidad que el código necesita para operar de forma concurrente o asíncrona.

source: It should be noted that, being a true queue, each value sent to the L<Channel> will only be available to a single reader on a first read, first served basis: if you want multiple readers to be able to receive every item sent you probably want to consider a L<Supply>.
es_es: Como se trata de una cola de verdad, hay que tener en cuenta que cada valor enviado al L<Canal> solo estará disponible al final de la cola para una sola operación de lectura. Si lo que necesitas es que cada elemento enviado a la cola pueda llegar a varias operaciones de lectura, probablemente necesites un L<Suministro>.

source: It showcases custom constructors, private and public attributes, methods and various aspects of signatures.
es_es: Podemos ver constructores personalizados, atributos privados y públicos, métodos y varios tipos de signaturas.

source: It's not very much code, and yet the result is interesting and, at times, useful.
es_es: Aunque no es mucho código, el resultado es interesante y hasta útil.

source: L Letter
es_es: L Letter (letra)

source: L<Proc::Async> builds on the facilities described to run and interact with an external program asynchronously:
es_es: L<Proc::Async> permite la comunicación de forma interactiva y asíncrona con programas externos:

source: LAST { say 'Job is done.' }
es_es: LAST { say 'Trabajo finalizado.' }

source: Ll Lowercase_Letter
es_es: Ll Lowercase_Letter (letra minúscula)

source: Lm Modifier_Letter
es_es: Lm Modifier_Letter (modificador de letra)

source: Lo Other_Letter
es_es: Lo Other_Letter (otras letras)

source: Lt Titlecase_Letter
es_es: Lt Titlecase_Letter (letra capitular)

source: Lu Uppercase_Letter
es_es: Lu Uppercase_Letter (letra mayúscula)

source: M Mark
es_es: M Mark (marca)

source: Manipulate @INC at compile time
es_es: Manipula @INC en tiempo de compilación

source: Mc Spacing_Mark
es_es: Mc Spacing_Mark (marca de espaciado)

source: Me Enclosing_Mark
es_es: Me Enclosing_Mark (marca de encierro)

source: Mn Nonspacing_Mark
es_es: Mn Nonspacing_Mark (marca de no-espacio)

source: N Number
es_es: N Number (número)

source: NOM!' },
es_es: ¡ÑAM!' },

source: Nd Decimal_Number (also Digit)
es_es: Nd Decimal_Number (número decimal) (también Digit (dígito))

source: Nl Letter_Number
es_es: Nl Letter_Number (letra que es un número)

source: No Other_Number
es_es: No Other_Number (otro número)

source: Note that the C<tap> is called on a L<Supply> object created by the L<Supplier> and new values are emitted on the L<Supplier>.
es_es: Observa que C<tap> es llamado en un objeto L<Supply> (Suministro) creado por L<Supplier> (Proveedor) y los nuevos valores se emiten desde L<Supplier> (Proveedor).

source: Notes:
es_es: Notas:

source: Objects of this class are not used directly but as a sub-class specific to the platform perl is running on via the C<$*SPEC> variable which will contain an object of the appropriate type.
es_es: Los objetos de esta clase no se usan directamente, sino como una subclase específica de la plataforma en la que perl se ejecuta a través de la variable C<$*SPEC> que contendrá un objeto del tipo apropiado.

source: Objects of type C<ObjAt> are the return value of C<.WHICH> calls on other objects, and identify an object uniquely.
es_es: Los objetos del tipo C<ObjAt> son el valor de retorno de las llamadas C<.WHICH> sobre otros objetos, e identifican de forma única a un objeto.

source: On object of this type is available via the variable C<$*SPEC> if the perl is running on a Unix-like platform.
es_es: Un objeto de este tipo está disponible a través de la variable C<$*SPEC> si el perl está ejecutándose sobre una plataforma estilo Unix.

source: One particular issue of note is when container autovivification or extension takes place.
es_es: Hay que tener en cuenta que existe un caso en particular cuando se produce una extensión.

source: Or alternatively as an C<on-demand> L<Supply> created by the C<supply> keyword:
es_es: La forma C<a demanda> de un L<Suministro> se crea mediante la palabra clave C<supply>:

source: Or can be created and run at a single invocation:
es_es: O puede crearse y ejecutarse en una sola invocación:

source: Otherwise, the exception continues to up the call tree (i.e., the same behavior as when C<quit> is not set).
es_es: En caso contrario, la excepción continuará subiendo por el árbol de la llamada (por ej., como cuando no se indica un C<quit>).

source: Output:
es_es: Salida:

source: Pc Connector_Punctuation
es_es: Pc Connector_Punctuation (conector de puntuación)

source: Pd Dash_Punctuation
es_es: Pd Dash_Punctuation (puntuación de guiones)

source: Pe Close_Punctuation
es_es: Pe Close_Punctuation (puntuación cerrada)

source: Perl 6 has a rich built in syntax for the definition and use of classes for object oriented programming, allowing for the definition of state (as L<attributes|#State>,) and behaviour (as L<methods|#Methods>,) in the objects of a class.
es_es: Perl 6 incorpora una sintaxis generosa para la definición y uso de clases en la programación orientada a objetos, permitiendo la definición de estados (mediante L<attributos|#State>), y el comportamiento (mediante L<métodos|#Methods>), en los objetos de una clase.

source: Perl 6, like many other languages, uses the C<class> keyword to introduce a new class.
es_es: Perl 6, al igual que otros lenguajes, utiliza la palabra clave C<class> para crear una clase nueva.

source: Pf Final_Punctuation
es_es: Pf Final_Punctuation (puntuación final)

source: Pi Initial_Punctuation
es_es: Pi Initial_Punctuation (puntuación inicial)

source: Po Other_Punctuation
es_es: Po Other_Punctuation (otra puntuación)

source: Promises gain much of their power by being composable, for example by chaining:
es_es: La gran robustez de las promesas radica en su componibilidad, por ejemplo permite realizar encadenamiento:

source: Ps Open_Punctuation
es_es: Ps Open_Punctuation (puntuación abierta)

source: QUIT { when X::MyApp::Error { say "App Error: ", $_.message } }
es_es: QUIT { when X::MyApp::Error { say "Error: ", $_.message } }

source: Rakudo allows the maximum number of threads allowed in the default scheduler to be set by the environment variable C<RAKUDO_MAX_THREADS> at the time the program is started.
es_es: Rakudo establece este máximo en la variable de entorno C<RAKUDO_MAX_THREADS> en el momento que inicia el programa.

source: Returns the custom message provided to C<!!!>, or a reasonable default if none was provided.
es_es: Devuelve el mensaje personalizado proporcionado a C<!!!>, o un valor razonable por defecto si no se proporciona nada.

source: Returns the level of the enumeration list, starting at 1.
es_es: Devuelve el nivel de la lista enumerada, empezando en 1.

source: Returns the object that threw the exception.
es_es: Devuelve el objeto que lanzó la excepción.

source: Returns the path L</routine/rmdir> failed to remove
es_es: Devuelve la ruta que L</routine/rmdir> no pudo eliminar

source: Returns the path that L</routine/dir> failed to read.
es_es: Devuelve la ruta que L</routine/dir> no pudo leer.

source: Returns the path that L</routine/unlink> failed to delete.
es_es: Devuelve la ruta que L</routine/unlink> no pudo eliminar.

source: Returns the path that was passed to the failed C<chdir> call.
es_es: Devuelve la ruta que se pasó a la fallida llamada a C<chdir>.

source: Returns the vowed Promise.
es_es: Devuelve la Promise jurada.

source: S Symbol
es_es: S Symbol (símbolo)

source: Sc Currency_Symbol
es_es: Sc Currency_Symbol (símbolo monetario)

source: Short Long
es_es: Corta Larga

source: Similarly if the code fails (and the promise is thus broken), then C<cause> will be the L<Exception> object that was thrown:
es_es: De forma parecida, si el código falla, la promesa lanzará una excepción en forma de objeto L<Exception> accesible mediante C<cause>:

source: Sk Modifier_Symbol
es_es: Sk Modifier_Symbol (modificador de símbolo)

source: Sm Math_Symbol
es_es: Sm Math_Symbol (símbolo matemático)

source: So
es_es: Así que

source: So Other_Symbol
es_es: So Other_Symbol (otro símbolo)

source: So this:
es_es: Así que esto:

source: So:
es_es: Así:

source: Some examples:
es_es: Algunos ejemplos:

source: Some programs (such as C<grep> without a file argument in this example, ) won't exit until their standard input is closed so L<close-stdin|/type/Proc::Async#method_close-stdin> can be called when you are finished writing to allow the L<Promise> returned by C<start> to be kept.
es_es: Algunos comandos (como C<grep> sin un fichero como argumento en este ejemplo) no finalizarán hasta que se cierre su entrada estándar. En este caso se llama a L<close-stdin|/type/Proc::Async#method_close-stdin> al final con el propósito de finalizar la L<Promesa> devuelta por C<start>.

source: Some shared data concurrency issues are less obvious than others.
es_es: Algunas situaciones de la concurrencia con datos compartidos son menos evidentes que otras.

source: Sorry.
es_es: Lo sentimos.

source: Syntax error thrown when C<#`> is encountered and it is not followed by an opening bracket.
es_es: Erro de sintaxis que se lanza cuando se encuentra C<#`> y no le sigue una llave de apertura.

source: Syntax error thrown when an C<unless> clause is followed by an C<else> clause.
es_es: Error de sintaxis que se lanza cuando a una cláusula C<unless> le sigue una cláusula C<else>.

source: Syntax error thrown when some piece of code is clearly Perl 5, not Perl 6.
es_es: Error de sintaxis que se lanza cuando alguna parte del código es claramente Perl 5, no Perl 6.

source: Syntax error when a stand alone quantifier (without an preceding atom to quantify) is encountered in a regular expression.
es_es: Error de sintaxis cuando un solitario cuantificador (sin un átomo precedente al cual cuantificar) se encuentra en una expresión regular.

source: Task.new({ say 'buying food' },
es_es: Tarea.new({ say 'comprar comida' },

source: Task.new({ say 'cleaning kitchen' })
es_es: Tarea.new({ say 'limpiar cocina' })

source: Task.new({ say 'eating dinner.
es_es: Tarea.new({ say 'cenar.

source: Task.new({ say 'going to the store' })
es_es: Tarea.new({ say 'ir de compras' })

source: Task.new({ say 'making dinner' },
es_es: Tarea.new({ say 'cocinar cena' },

source: Task.new({ say 'making some money' }),
es_es: Tarea.new({ say 'trabajar' }),

source: The following code outputs 0 ..
es_es: El siguiente código visualiza 0 ..

source: The C<%> sigil restricts variables to objects that do C<Associative>.
es_es: El sigilo C<%> restringe las variables a objetos que hacen C<Associative>.

source: The C<last> command immediately exits the loop in question.
es_es: El comando C<last> sale inmediatamente del bucle en cuestión.

source: The C<quit> block works very similar to a C<CATCH>.
es_es: El bloque C<quit> es muy similar a C<CATCH>.

source: The C<react> block is exited when C<done()> is called in one of the taps.
es_es: La salida del bloque C<react> se realiza llamando a C<done()> en cualquier tap.

source: The C<redo> command restarts the loop block without evaluating the conditional again.
es_es: El comando C<redo> reinicia la iteración sin evaluar de nuevo la condición.

source: The C<tap> method returns a L<Tap> object which can be used to obtain information about the tap and also to turn it off when we are no longer interested in the events:
es_es: El método C<tap> devuelve un objeto L<Tap> que puede utilizarse para obtener información sobre la suscripción (tap) y también cerrarlo cuando no se esté interesado en los eventos que pudieran llegar:

source: The L<CurrentThreadScheduler> is a very simple scheduler that will always schedule code to be run straight away on the current thread.
es_es: L<CurrentThreadScheduler> es un programador muy simple que siempre programará la ejecución del código de forma inmediata en el hilo actual.

source: The L<Supply> can either be C<live> or C<on-demand>.
es_es: Un L<Suministro> puede ser C<a tiempo real> o C<a demanda>.

source: The L<ThreadPoolScheduler> is the default scheduler, it maintains a pool of threads that are allocated on demand, creating new ones as necessary up to maximum number given as a parameter when the scheduler object was created (the default is 16.)
es_es: L<ThreadPoolScheduler> es el programador por defecto, mantiene un conjunto de hilos que pueden asignarse a demanda y puede crear hilos nuevos si es necesario hasta un máximo indicado como parámetro al crear el objeto del programador (por defecto son 16 hilos como máximo).

source: The L<method closed|/type/Channel#method_closed> returns a L<Promise> that will be kept (and consequently will evaluate to True in a boolean context,) when the channel is closed.
es_es: El L<método closed|/type/Channel#method_closed> devuelve una L<Promesa> de forma que cuando ésta finalice (kept) indicará que el canal está cerrado y se evaluará como True.

source: The L<method in|/type/Promise#method_in> creates a new promise and schedules a new task to call C<keep> on it no earlier than the supplied number of seconds, returning the new L<Promise> object.
es_es: El L<método in|/type/Promise#method_in> crea una promesa nueva y programa una tarea nueva para iniciarla en un número de segundos determinado, devolviendo un nuevo objeto L<Promesa>.

source: The L<method list|/type/Channel#method_list> returns all the items on the L<Channel> and will block until further items are queued unless the channel is closed:
es_es: El L<método list|/type/Channel#method_list> devuelve todos los elementos del L<Canal> y la bloquea hasta que se encolen más elementos a menos que el canal se cierre:

source: The L<start method|/type/Promise#method_start> provides a shortcut for that:
es_es: Para ello se utiliza el L<método start|/type/Promise#method_start>:

source: The actual L<Exception> object will then be available from C<cause>.
es_es: El objeto L<Exception> actual queda disponible con C<cause>.

source: The aim of the Perl concurrency design is to provide a high-level, composable, consistent interface, regardless of how a virtual machine may implement it for a particular operating system, through layers of facilities as described below.
es_es: El propósito del diseño de la concurrencia en Perl 6 es proporcionar una interfaz de alto nivel, componible y robusta, independientemente de cómo lo implemente la máquina virtual para un sistema operativo dado, a través de los objetos que veremos a continuación.

source: The behavior here is the same as setting C<done> and C<quit> on C<tap>.
es_es: El funcionamiento es igual que utilizar C<done> y C<quit> en el C<tap>.

source: The block that follows may contain arbitrary code, just as with any other block, but classes commonly contain state and behavior declarations.
es_es: El bloque que sigue puede contener cualquier código, como cualquier otro, pero las clases normalmente contiene declaraciones relacionadas con el estado y el funcionamiento.

source: The class L<Lock> provides the low level mechanism that protects shared data in a concurrent environment and is thus key to supporting thread-safety in the high level API, this is sometimes known as a "Mutex" in other programming languages.
es_es: La clase L<Lock> proporciona un mecanismo de bajo nivel que protege datos compartidos en un entorno concurrente y además es la clave en la seguridad multihilo en la API de alto nivel. Este mecanismo a veces es conocido como "Mutex" en otros lenguajes de programación.

source: The command will not be executed until L<start|/type/Proc::Async#method_start> is called, which will return a L<Promise> that will be kept when the program exits.
es_es: Cuando se realice la llamada a L<start|/type/Proc::Async#method_start> se ejecutará el comando y devolverá una L<Promesa> completada cuando el comando finalice.

source: The current default global scheduler is available in the variable C<$*SCHEDULER>.
es_es: Por ahora, el programador global por defecto está disponible en la variable C<$*SCHEDULER>.

source: The data that is emitted is an integer starting at 0 that is incremented for each event.
es_es: El dato que se emite en este caso es un entero que comienza en 0 y se incrementa en cada evento.

source: The example above uses the class name C<Task> so that other code can refer to it later, such as to create class instances by calling the C<new> method.
es_es: El ejemplo anterior utiliza C<Tarea> como nombre de la clase, de forma que puede utilizarse después para crear instancias de esa clase mediante el método C<new>.

source: The example code includes attributes (state), introduced through the C<has> keyword, and behaviors introduced through the C<method> keyword.
es_es: El código de ejemplo incluye atributos (estado) mediante la palabra clave C<has> y el funcionamiento mediante la palabra clave C<method>.

source: The following, more elaborate, example shows how a dependency handler might look in Perl 6.
es_es: El siguiente ejemplo (más elaborado), muestra cómo sería en Perl 6 un gestor de dependencias.

source: The implication is that C<cue> on this scheduler will block until the code finishes execution, limiting its utility to certain special cases such as testing.
es_es: Las implicaciones de C<cue> en este programador es el bloqueo hasta que finalice la ejecución del código, por lo que su uso se limita de forma especial como en el caso de realizar pruebas.

source: The intent of the scheduler interface is to provide a mechanism to determine which resources to use to run a particular task and when to run it.
es_es: El propósito de la interface del programador es ofrecer un mecanismo que determine los recursos utilizar necesarios para llevar a cabo una tarea en particular y cuando iniciar ésta.

source: The latter behaviour is illustrated with:
es_es: Esto lo vamos a ver a continuación:

source: The lowest level interface for concurrency is provided by L<Thread>.
es_es: En relación a la concurrencia, la interface de más bajo nivel la proporciona L<Thread>.

source: The majority of the higher level concurrency APIs are built upon a scheduler and it may not be necessary for user code to use them at all, although some methods such as those found in L<Proc::Async>, L<Promise> and L<Supply> allow you to explicitly supply a scheduler.
es_es: La mayor parte de las APIs de alto nivel incluidas en la concurrencia se basan en un programador y no tienen por qué ser necesarias en absoluto, si bien algunos métodos como los encontrados en L<Proc::Async>, L<Promise> y L<Supply> te permiten suministrar un programador de forma explícita.
